Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/FLCTL_356.0.xml
<module id="FLCTL" HW_revision="356.0">
    <register id="FLCTL_POWER_STAT" width="32" offset="0x0" internal="0" description="Power Status Register">
        <bitfield id="PSTAT" description="Flash power status" begin="2" end="0" width="3" rwaccess="R">
            <bitenum id="PSTAT_0" value="0x0" description="Flash IP in power-down mode"/>
            <bitenum id="PSTAT_1" value="0x1" description="Flash IP Vdd domain power-up in progress"/>
            <bitenum id="PSTAT_2" value="0x2" description="PSS LDO_GOOD, IREF_OK and VREF_OK check in progress"/>
            <bitenum id="PSTAT_3" value="0x3" description="Flash IP SAFE_LV check in progress"/>
            <bitenum id="PSTAT_4" value="0x4" description="Flash IP Active"/>
            <bitenum id="PSTAT_5" value="0x5" description="Flash IP Active in Low-Frequency Active and Low-Frequency LPM0 modes."/>
            <bitenum id="PSTAT_6" value="0x6" description="Flash IP in Standby mode"/>
            <bitenum id="PSTAT_7" value="0x7" description="Flash IP in Current mirror boost state"/>
        </bitfield>
        <bitfield id="LDOSTAT" description="PSS FLDO GOOD status" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="LDOSTAT_0" value="0x0" description="FLDO not GOOD"/>
            <bitenum id="LDOSTAT_1" value="0x1" description="FLDO GOOD"/>
        </bitfield>
        <bitfield id="VREFSTAT" description="PSS VREF stable status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="VREFSTAT_0" value="0x0" description="Flash LDO not stable"/>
            <bitenum id="VREFSTAT_1" value="0x1" description="Flash LDO stable"/>
        </bitfield>
        <bitfield id="IREFSTAT" description="PSS IREF stable status" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="IREFSTAT_0" value="0x0" description="IREF not stable"/>
            <bitenum id="IREFSTAT_1" value="0x1" description="IREF stable"/>
        </bitfield>
        <bitfield id="TRIMSTAT" description="PSS trim done status" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="TRIMSTAT_0" value="0x0" description="PSS trim not complete"/>
            <bitenum id="TRIMSTAT_1" value="0x1" description="PSS trim complete"/>
        </bitfield>
        <bitfield id="RD_2T" description="Indicates if Flash is being accessed in 2T mode" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="RD_2T_0" value="0x0" description="Flash reads are in 1T mode"/>
            <bitenum id="RD_2T_1" value="0x1" description="Flash reads are in 2T mode"/>
        </bitfield>
    </register>
    <register id="FLCTL_BANK0_RDCTL" width="32" offset="0x10" internal="0" description="Bank0 Read Control Register">
        <bitfield id="RD_MODE" description="Flash read mode control setting for Bank 0" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="RD_MODE_0" value="0x0" description="Normal read mode"/>
            <bitenum id="RD_MODE_1" value="0x1" description="Read Margin 0"/>
            <bitenum id="RD_MODE_2" value="0x2" description="Read Margin 1"/>
            <bitenum id="RD_MODE_3" value="0x3" description="Program Verify"/>
            <bitenum id="RD_MODE_4" value="0x4" description="Erase Verify"/>
            <bitenum id="RD_MODE_5" value="0x5" description="Leakage Verify"/>
            <bitenum id="RD_MODE_9" value="0x9" description="Read Margin 0B"/>
            <bitenum id="RD_MODE_10" value="0xA" description="Read Margin 1B"/>
        </bitfield>
        <bitfield id="BUFI" description="Enables read buffering feature for instruction fetches to this Bank" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BUFD" description="Enables read buffering feature for data reads to this Bank" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WAIT" description="Number of wait states for read" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="WAIT_0" value="0x0" description="0 wait states"/>
            <bitenum id="WAIT_1" value="0x1" description="1 wait states"/>
            <bitenum id="WAIT_2" value="0x2" description="2 wait states"/>
            <bitenum id="WAIT_3" value="0x3" description="3 wait states"/>
            <bitenum id="WAIT_4" value="0x4" description="4 wait states"/>
            <bitenum id="WAIT_5" value="0x5" description="5 wait states"/>
            <bitenum id="WAIT_6" value="0x6" description="6 wait states"/>
            <bitenum id="WAIT_7" value="0x7" description="7 wait states"/>
            <bitenum id="WAIT_8" value="0x8" description="8 wait states"/>
            <bitenum id="WAIT_9" value="0x9" description="9 wait states"/>
            <bitenum id="WAIT_10" value="0xA" description="10 wait states"/>
            <bitenum id="WAIT_11" value="0xB" description="11 wait states"/>
            <bitenum id="WAIT_12" value="0xC" description="12 wait states"/>
            <bitenum id="WAIT_13" value="0xD" description="13 wait states"/>
            <bitenum id="WAIT_14" value="0xE" description="14 wait states"/>
            <bitenum id="WAIT_15" value="0xF" description="15 wait states"/>
        </bitfield>
        <bitfield id="RD_MODE_STATUS" description="Read mode" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="RD_MODE_STATUS_0" value="0x0" description="Normal read mode"/>
            <bitenum id="RD_MODE_STATUS_1" value="0x1" description="Read Margin 0"/>
            <bitenum id="RD_MODE_STATUS_2" value="0x2" description="Read Margin 1"/>
            <bitenum id="RD_MODE_STATUS_3" value="0x3" description="Program Verify"/>
            <bitenum id="RD_MODE_STATUS_4" value="0x4" description="Erase Verify"/>
            <bitenum id="RD_MODE_STATUS_5" value="0x5" description="Leakage Verify"/>
            <bitenum id="RD_MODE_STATUS_9" value="0x9" description="Read Margin 0B"/>
            <bitenum id="RD_MODE_STATUS_10" value="0xA" description="Read Margin 1B"/>
        </bitfield>
    </register>
    <register id="FLCTL_BANK1_RDCTL" width="32" offset="0x14" internal="0" description="Bank1 Read Control Register">
        <bitfield id="RD_MODE" description="Flash read mode control setting for Bank 0" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="RD_MODE_0" value="0x0" description="Normal read mode"/>
            <bitenum id="RD_MODE_1" value="0x1" description="Read Margin 0"/>
            <bitenum id="RD_MODE_2" value="0x2" description="Read Margin 1"/>
            <bitenum id="RD_MODE_3" value="0x3" description="Program Verify"/>
            <bitenum id="RD_MODE_4" value="0x4" description="Erase Verify"/>
            <bitenum id="RD_MODE_5" value="0x5" description="Leakage Verify"/>
            <bitenum id="RD_MODE_9" value="0x9" description="Read Margin 0B"/>
            <bitenum id="RD_MODE_10" value="0xA" description="Read Margin 1B"/>
        </bitfield>
        <bitfield id="BUFI" description="Enables read buffering feature for instruction fetches to this Bank" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BUFD" description="Enables read buffering feature for data reads to this Bank" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RD_MODE_STATUS" description="Read mode" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="RD_MODE_STATUS_0" value="0x0" description="Normal read mode"/>
            <bitenum id="RD_MODE_STATUS_1" value="0x1" description="Read Margin 0"/>
            <bitenum id="RD_MODE_STATUS_2" value="0x2" description="Read Margin 1"/>
            <bitenum id="RD_MODE_STATUS_3" value="0x3" description="Program Verify"/>
            <bitenum id="RD_MODE_STATUS_4" value="0x4" description="Erase Verify"/>
            <bitenum id="RD_MODE_STATUS_5" value="0x5" description="Leakage Verify"/>
            <bitenum id="RD_MODE_STATUS_9" value="0x9" description="Read Margin 0B"/>
            <bitenum id="RD_MODE_STATUS_10" value="0xA" description="Read Margin 1B"/>
        </bitfield>
        <bitfield id="WAIT" description="Number of wait states for read" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="WAIT_0" value="0x0" description="0 wait states"/>
            <bitenum id="WAIT_1" value="0x1" description="1 wait states"/>
            <bitenum id="WAIT_2" value="0x2" description="2 wait states"/>
            <bitenum id="WAIT_3" value="0x3" description="3 wait states"/>
            <bitenum id="WAIT_4" value="0x4" description="4 wait states"/>
            <bitenum id="WAIT_5" value="0x5" description="5 wait states"/>
            <bitenum id="WAIT_6" value="0x6" description="6 wait states"/>
            <bitenum id="WAIT_7" value="0x7" description="7 wait states"/>
            <bitenum id="WAIT_8" value="0x8" description="8 wait states"/>
            <bitenum id="WAIT_9" value="0x9" description="9 wait states"/>
            <bitenum id="WAIT_10" value="0xA" description="10 wait states"/>
            <bitenum id="WAIT_11" value="0xB" description="11 wait states"/>
            <bitenum id="WAIT_12" value="0xC" description="12 wait states"/>
            <bitenum id="WAIT_13" value="0xD" description="13 wait states"/>
            <bitenum id="WAIT_14" value="0xE" description="14 wait states"/>
            <bitenum id="WAIT_15" value="0xF" description="15 wait states"/>
        </bitfield>
    </register>
    <register id="FLCTL_RDBRST_CTLSTAT" width="32" offset="0x20" internal="0" description="Read Burst/Compare Control and Status Register">
        <bitfield id="START" description="Start of burst/compare operation" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MEM_TYPE" description="Type of memory that burst is carried out on" begin="2" end="1" width="2" rwaccess="R/W">
            <bitenum id="MEM_TYPE_0" value="0x0" description="Main Memory"/>
            <bitenum id="MEM_TYPE_1" value="0x1" description="Information Memory"/>
            <bitenum id="MEM_TYPE_2" value="0x2" description="Reserved"/>
        </bitfield>
        <bitfield id="STOP_FAIL" description="Terminate burst/compare operation" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DATA_CMP" description="Data pattern used for comparison against memory read data" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DATA_CMP_0" value="0x0" description="0000_0000_0000_0000_0000_0000_0000_0000"/>
            <bitenum id="DATA_CMP_1" value="0x1" description="FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF"/>
        </bitfield>
        <bitfield id="TEST_EN" description="Enable comparison against test data compare registers" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BRST_STAT" description="Status of Burst/Compare operation" begin="17" end="16" width="2" rwaccess="R">
            <bitenum id="BRST_STAT_0" value="0x0" description="Idle"/>
            <bitenum id="BRST_STAT_1" value="0x1" description="Burst/Compare START bit written, but operation pending"/>
            <bitenum id="BRST_STAT_2" value="0x2" description="Burst/Compare in progress"/>
            <bitenum id="BRST_STAT_3" value="0x3" description="Burst complete (status of completed burst remains in this state unless explicitly cleared by SW)"/>
        </bitfield>
        <bitfield id="CMP_ERR" description="Burst/Compare Operation encountered atleast one data" begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADDR_ERR" description="Burst/Compare Operation was terminated due to access to" begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CLR_STAT" description="Clear status bits 19-16 of this register" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
    </register>
