Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/FLCTL_356.0.xml
    <register id="FLCTL_BANK1_MAIN_WEPROT" width="32" offset="0xC4" internal="0" description="Main Memory Bank1 Write/Erase Protection Register">
        <bitfield id="PROT0" description="Protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT1" description="Protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT2" description="Protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT3" description="Protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT4" description="Protects Sector 4 from program or erase operations" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT5" description="Protects Sector 5 from program or erase operations" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT6" description="Protects Sector 6 from program or erase operations" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT7" description="Protects Sector 7 from program or erase operations" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT8" description="Protects Sector 8 from program or erase operations" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT9" description="Protects Sector 9 from program or erase operations" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT10" description="Protects Sector 10 from program or erase operations" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT11" description="Protects Sector 11 from program or erase operations" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT12" description="Protects Sector 12 from program or erase operations" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT13" description="Protects Sector 13 from program or erase operations" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT14" description="Protects Sector 14 from program or erase operations" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT15" description="Protects Sector 15 from program or erase operations" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT16" description="Protects Sector 16 from program or erase operations" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT17" description="Protects Sector 17 from program or erase operations" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT18" description="Protects Sector 18 from program or erase operations" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT19" description="Protects Sector 19 from program or erase operations" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT20" description="Protects Sector 20 from program or erase operations" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT21" description="Protects Sector 21 from program or erase operations" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT22" description="Protects Sector 22 from program or erase operations" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT23" description="Protects Sector 23 from program or erase operations" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT24" description="Protects Sector 24 from program or erase operations" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT25" description="Protects Sector 25 from program or erase operations" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT26" description="Protects Sector 26 from program or erase operations" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT27" description="Protects Sector 27 from program or erase operations" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT28" description="Protects Sector 28 from program or erase operations" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT29" description="Protects Sector 29 from program or erase operations" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT30" description="Protects Sector 30 from program or erase operations" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROT31" description="Protects Sector 31 from program or erase operations" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="FLCTL_BMRK_CTLSTAT" width="32" offset="0xD0" internal="0" description="Benchmark Control and Status Register">
        <bitfield id="I_BMRK" description="When 1, increments the Instruction Benchmark count register on each instruction fetch to the Flash" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="D_BMRK" description="When 1, increments the Data Benchmark count register on each data read access to the Flash" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CMP_EN" description="When 1, enables comparison of the Instruction or Data Benchmark Registers against the threshold value" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CMP_SEL" description="Selects which benchmark register should be compared against the threshold" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="en_1_00" value="0x0" description="Compares the Instruction Benchmark Register against the threshold value"/>
            <bitenum id="en_2_01" value="0x1" description="Compares the Data Benchmark Register against the threshold value"/>
        </bitfield>
    </register>
