Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/FLCTL_356.0.xml
    <register id="FLCTL_PROGRAM_TIMCTL" width="32" offset="0x114" internal="0" description="Program Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
        <bitfield id="HOLD" description="Length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_ERASE_TIMCTL" width="32" offset="0x118" internal="0" description="Erase Timing Control Register">
        <bitfield id="SETUP" description="Length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
        <bitfield id="HOLD" description="Length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_MASSERASE_TIMCTL" width="32" offset="0x11C" internal="0" description="Mass Erase Timing Control Register">
        <bitfield id="BOOST_ACTIVE" description="Length of the time for which LDO Boost Signal is kept active" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="BOOST_HOLD" description="Length for which Flash deactivates the LDO Boost signal before processing any new commands" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="FLCTL_BURSTPRG_TIMCTL" width="32" offset="0x120" internal="0" description="Burst Program Timing Control Register">
        <bitfield id="ACTIVE" description="Length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R">
        </bitfield>
    </register>
</module>
